rails/app/controllers/permissions_controller.rb

SELECT "permissions".* FROM "permissions"
---
  def index
    @permissions = Permission.all

INSERT INTO "permissions" ("user_id", "permission_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["permission_type", "admin"], ["created_at", "2024-08-31 00:41:58.458980"], ["updated_at", "2024-08-31 00:41:58.458980"]]
---
  def create
    byebug
    # permission_params.require(:permission).permit(:user_id)
    type = params[:permission][:permission_type]
    user_id = params[:permission][:user_id]
    @permission = Permission.new(permission_type:type, user_id:user_id)

    respond_to do |format|
      if @permission.save

SELECT "permissions".* FROM "permissions" WHERE "permissions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_permission
      @permission = Permission.find(params[:id])